---
kind: enumMember
id: F:Autodesk.Revit.DB.FittingAndAccessoryCalculationType.ValidateCurrentSettings
enum: Autodesk.Revit.DB.FittingAndAccessoryCalculationType
source: html/6bc45325-d5e3-c389-d30a-39a3e6799103.htm
---
# Autodesk.Revit.DB.FittingAndAccessoryCalculationType.ValidateCurrentSettings

To validate the current settings of the fitting and accessory.